# Aula 12. Pandas
<img  src= "img/pandas1.jpeg" style="width:500px; height:500px">

Pandas é uma das bibliotecas mais utilizadas em Python para manipulação e análise de dados. Esta biblioteca é de código aberto, escrita em Numpy e oferece estruturas e operações para manipulação de tabelas numéricas e séries temporais.

Os principais destaques são:
- Possui dois tipos de objetos `pandas.core.frame.DataFrame` e `pandas.core.series.Series` com indexação integrada;
- Facilita a leitura, escrita e modificação de arquivos com diferentes formatos, entre os quais se destaca .csv, .txt, .xlsx, SQL, HDF5 (Hierarchical Data Format version 5) dentre outros;
- Permite tabelas com diferentes niveis de indexação;
- Permite agrupamento de dados por categorias;
- Realiza mesclagem e junção de conjuntos de dados com alto desempenho;
- Altamente otimizado com códigos escritos em Cython e C;
- Pandas é amplamente utilizado em ambientes acadêmicos e comerciais, incluindo finanças, neurociência, economia, estatística, publicidade, análise da web e muito mais.
---
 
  <font size="6"> Os tópicos que vamos abordar nesta série de conversas são:</font>

- [X] Instalação de pandas;
- [x] Importando pandas;
- [x] Series;
- [x] DataFrame e manipulação;
 - [X] Criação de DataFrame;
 - [X] Extraindo informação por colunas. CUIDADO COM NOTAÇÃO SQL;
 - [X] Extraindo utilizando função loc;
 - [X] Extraindo utilizando função iloc;
 - [X] Adicionando novas colunas;
 - [X] Adicionando novas filas (função append);
 - [X] Eliminando colunas ou filas.
- [X] Operadores de comparação e seleção condicional;
- [X] Dados ausentes;
 - [X] Dropna
 - [X] filna
 - [X] replace
- [X] Groupby, aggregate e apply
- [ ] Juntando diffenrentes `DataFrame` 
 - [ ] `concat`
 - [ ] `merge`
 - [ ] `join`
- [ ] Operações
 - [ ] unique
 - [ ] nunique
 - [ ] value_counts
 - [ ] del ( )
 - [ ] columns
 - [ ] index
 - [ ] sort_values
 - [ ] pivol
- [ ] Importando e exportando dados.
 - [ ] csv
 - [ ] excell
 - [ ] html
- Aplicação
---
<font size="5"> Recomento visitar o site oficial do projeto [Pandas](https://pandas.pydata.org/) para conhecer mais um pouco desta biblioteca.</font>

## Intalação do pandas

Para instalar pandas no nosso computador podemos utilizar o condas ou o pip.
```python
conda install pandas
pip install pandas
```

## importando pandas e numpy

In [1]:
import pandas as pd
import numpy as np

## Series
O conceito principal de uma [Series](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html) em Pandas e trabalhar com vetores a partir do indice ou labels. A sintaxe para definir uma Series é:
```python
 pandas.Series(data=None, index=None, dtype=None, name=None, copy=False, fastpath=False)
```

In [ ]:
# Definindo algumas variaveis que vamos utilizar
valores  = np.random.randn(1, 10).reshape(10,)
index_row = "A B C D E F G H I J".split(" ")
d = {key: value for key, value in zip(index_row, valores)}

In [ ]:
# Criando uma Series passando somente os valores
pd.Series(valores)

In [ ]:
# Criando uma Series passando data e index
pd.Series(data=valores, index=index_row)

In [ ]:
# Observemos que pomodes criar uma Series passando qualquer tipo de dados
pd.Series(index=valores, data=index_row)

In [ ]:
# Observemos que uma Series se comporta muito semelhante ao dicionário dado que ela trabalhar com chave: valor,
# portanto podemos criar uma Seires passando um dicionário
pd.Series(d)

Mas qual é a vantagem de utilizar uma Series em relação ao arrays?

In [ ]:
series_1 = pd.Series(data=[5, 10, 20, 30, 8], index="A B C D J".split(" "))
series_2 = pd.Series(data=[20, 15, 15, 5, 25], index="A B K D C".split(" "))
print(series_1)
print(series_2)
print(series_1 + series_2)

## DataFrame e manipulação
O objeto principal de Pandas é o [DataFrame](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html), este objeto se aproxima ao que conhecemos como planilha de excell (somente em aparência). Para definir um DataFrame utilizamos a seguinte sintaxe:
```python
pandas.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)
```
Neste caso os argumentos mais relevantes são `data`, `index` e `columns`, porém o único argumento obrigatório é o `data`.

### Criação de DataFrame

In [ ]:
data = np.arange(1, 17).reshape((4,4))
index = "Row_1 Row_2 Row_3 Row_4".split(" ")
col = "Col_1 Col_2 Col_3 Col_4".split(" ")

In [ ]:
data

In [ ]:
# Definindo um DataFrame passando data
pd.DataFrame(data)

In [ ]:
# Definindo um DataFrame passando data e index
pd.DataFrame(data, index)

In [ ]:
# Definindo um DataFrame passando todos data, index e columns
data_frame = pd.DataFrame(data, index, col)
data_frame

### Extraindo informação por colunas. *CUIDADO COM NOTAÇÃO SQL*

In [ ]:
# Extraindo informação da columna Col_4
data_frame["Col_4"]

In [ ]:
# Podemos utilizar a notação de ponto e o nome da columna, porém esta forma não é recomendada
data_frame.Col_3

### Extraindo utilizando função loc
A propriedade [`loc`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.loc.html) permite obter os dados de um DataFrame a partir dos labels das filas e das coluna. A sintaxe para aplicar esta propriedade é:
```python
DataFrame.loc[]
```

In [ ]:
# Podemos utilizar a função loc para extrair informação utilizando o índice da fila e o nome da coluna
data_frame.loc["Row_1", "Col_1"]

In [ ]:
# Para extrair diferentes colunas ou fila passamos uma lista com os nomes das colunas e filas
data_frame.loc[["Row_1", "Row_4"], ["Col_1", "Col_4"]]

In [ ]:
# Também podemos utilizar a função loc para extrair filas
data_frame.loc["Row_3"]

### Extraindo utilizando função iloc
Existe outra forma de extrair os valores de um DataFrame utilizando a notação aprendida em Numpy, para isso utilizamos a propriedade [`iloc`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iloc.html):
```python
DataFrame.iloc[]
```

In [ ]:
data_frame.iloc[0, 0]

In [ ]:
data_frame.iloc[ [0, -1], [0, -1]]

In [ ]:
data_frame.iloc[2]

In [ ]:
data_frame.iloc[2:]

### Adicionando novas colunas

In [ ]:
data_frame["Col_nova"] = data_frame.iloc[:, -1] + data_frame.iloc[:, 0]
data_frame

In [ ]:
data_frame["Col_nova_2"]  = 2
data_frame

In [ ]:
data_frame

### Adicionando novas filas (função append)
Para adicionar uma nova fila utilizamos a função [append()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.append.html), essa função adiciona uma nova (ou novas) fila(s) no final do DataFrame. A sintaxe utilizada para isso é:
```python
DataFrame.append(other, ignore_index=False, verify_integrity=False, sort=False)
```

In [ ]:
np.array([[1,2,3,4]])

In [ ]:
data_frame2 = pd.DataFrame([[1,2,3,4]], columns=col)
data_frame.append(data_frame2)

In [ ]:
data_frame.append(data_frame*10)

### Eliminando colunas ou filas
Para eliminar colunas ou filas de um DataFrame utilizamos a função [`drop`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html). Neste caso se deve passar o indice da fila que será eliminada ou o label da coluna. Além disso, deve-se especificar o `axis` o qual é 0 para filas e 1 para columnas. A sintaxe utilizada é:

```python
DataFrame.drop(labels=None, axis=0, index=None, columns=None, level=None, inplace=False, errors='raise')
```

In [ ]:
data_frame

In [ ]:
# Eliminando a primeira fila
data_frame.drop("Row_1", axis=0)

In [ ]:
# Eliminando varias filas 
data_frame.drop(["Row_1", "Row_3"], axis=0)

In [ ]:
# Eliminando a primeira coluna
data_frame.drop("Col_1", axis=1)

In [ ]:
data_frame

In [ ]:
# Eliminando a varias colunas coluna
data_frame.drop(["Col_1", "Col_4"], axis=1, inplace=True)

In [ ]:
data_frame
# é interessante o fato de não modificar o data_frame original?

## Operadores de comparação e seleção condicional
Da mesma forma que é possível aplicar operadores de comparação em arrays, com pandas podemos aplicar os mesmos operadores.

In [ ]:
# Criando dados para trabalhar
np.random.seed(100)
data2 = np.random.randint(-10, 10, (5,5))
col2 = [f"Col_{i}" for i in range(1, 6)]
row2 = [f"Row_{i}" for i in range(1, 6)]
data_frame2 = pd.DataFrame(data2, row2, col2)
data_frame2

In [ ]:
data_frame2 > 0

In [ ]:
# Podemos atribuir esse teste de comparação a uma variável e utiliza-o para realizar seleção
comp = data_frame2 > 0
data_frame2[comp] 
# data_frame2[data_frame2 > 0] 
data_frame2

In [ ]:
# Aplicando uma comparação numa serie
comp = data_frame2["Col_5"] > 0
data_frame2[comp]["Col_1"]
data_frame2

In [ ]:
# Aplicando comparações multiples
comp1 = data_frame2["Col_5"] >= 2 #(Row_1, Row_2 e Row_4)
comp2 = data_frame2["Col_3"] < -1 # (Row_1, Row_2)
data_frame2[comp2 & comp1]

In [ ]:
# As tres linhas anteriores são equivalentes a:
data_frame2[(data_frame2["Col_5"] >= 2) & (data_frame2["Col_3"] < -1)]

In [ ]:
data_frame2

## Dados ausentes
Quando trabalhamos com dados provenientes de fontes externas (como base de dados, dados de sensores, etc), pode acontecer que existam dados com valores "inapropriados" ou valores ausentes. Nesse caso a biblioteca Pandas ajuda a processar esses valores.

Cabe destacar que o conceito de dado "inapropriado" varia de cenário para cenário e aforma de tratar esses dados pode varia. Porém, Pandas possui uma diversa variedade de funções e metódos que podem ser utilizados para essa finalidade.

Recomendo a leitura de [Working with missing data](https://pandas.pydata.org/pandas-docs/stable/user_guide/missing_data.html). Nesta leitura a empresa desenvolvedora da biblioteca Pandas apresenta varias formas de processar dados ausentes.

In [2]:
# Criando data frame com valores nan
np.random.seed(100)
n = 10
data2 = np.random.randint(-10, 10, (n, n)).astype(object)
col2 = [f"Col_{i}" for i in range(1, n + 1)]
row2 = [f"Row_{i}" for i in range(1, n + 1)]
for r in range(n):
    for c in range(n):
        if np.random.random() < 0.25:
            data2[r, c] = np.nan
data_frame_nan = pd.DataFrame(data2, row2, col2)
data_frame_nan

       Col_1 Col_2 Col_3 Col_4 Col_5 Col_6 Col_7 Col_8 Col_9 Col_10
Row_1     -2    -7   NaN     5     6     0    -8    -8    -8      4
Row_2     -8     7     6   NaN    -6     1     6    -1    -8    NaN
Row_3     -6    -9     3     9    -6    -6    -7    -3     7      5
Row_4    NaN   NaN   NaN     6    -8   NaN     9    -8     4      7
Row_5      6     5    -3     3   NaN     2     8   -10    -8      0
Row_6      7   NaN     3     0   NaN   NaN     8    -2     9      4
Row_7    -10   NaN     2     0   NaN    -4   NaN     5     0    NaN
Row_8     -7   NaN     6     1    -6    -5    -3    -4    -8      0
Row_9      8   NaN     2    -9    -4     0   -10    -8     9     -6
Row_10     8   NaN   NaN    -1   NaN     6    -4    -5   NaN    NaN

### Dropna

Para excluir valores faltantes `NaN` utilizamos a função [`dropna`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html). Os argumentos necessarios para esta função são:

```python
DataFrame.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)
```

In [ ]:
# Elimiando os valores NaN, observemos que o resultado é somente Row_3
# Neste caso definimos axis=0, o que indica que caso alguma fila tenha pelo menos um Nan, a fila será excluida
data_frame_nan.dropna(axis=0)

In [ ]:
# Elimiando os valores NaN, observemos que o resultado é somente Col_8
# Neste caso definimos axis=0, o que indica que caso alguma fila tenha pelo menos um Nan, a fila será excluida
data_frame_nan.dropna(axis=1)

In [ ]:
# Também podemos definir a quantidade de valores no Nan que vamos aceitar. Por tanto se queremos aceitar
# pelo menos um NaN devemos de passar `thresh=9`
data_frame_nan.dropna(axis=1,thresh=9)

In [ ]:
# Observemos que a tabela original não foi modificada.
data_frame_nan

In [ ]:
# Se queremos modificar o arquivo original devemos passar `inplace=True`
data_frame_nan.dropna(axis=1,thresh=7, inplace=True)
data_frame_nan

### fillna
Outra forma de processar os dados faltantes é utilizando a função [`fillna`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.fillna.html) a qual permite substituir o valor faltante por outro valor.
```python
DataFrame.fillna(value=None, method=None, axis=None, inplace=False, limit=None, downcast=None)
```

In [ ]:
# Criando data frame com valores nan
np.random.seed(100)
n = 10
data2 = np.random.randint(25, 37, (n, n)).astype(object)
col2 = [f"Day_{i}" for i in range(1, n + 1)]
row2 = [f"Time_{i}" for i in range(1, n + 1)]
for r in range(n):
    for c in range(n):
        if np.random.random() < 0.25:
            data2[r, c] = np.nan
data_frame_fillna = pd.DataFrame(data2, row2, col2)
data_frame_fillna

In [ ]:
data_frame_fillna.fillna(value="VALOR ERRADO")

In [ ]:
# Caso queiramos preencher o valor faltante pelo valor anterior podemos realizar isso aplicando o `method="ffill"`
# Criando data frame com valores nan
np.random.seed(100)
n = 1440 # Equivalente a coleta de pontos cada 60 segundos por 24 h
r_n = 5
data2 = np.random.randint(27, 33, (n, r_n)).astype(object)
col2 = [f"Reactor_{i}" for i in range(1, r_n + 1)]
row2 = [f"Time_{i}" for i in range(1, n + 1)]
for r in range(data2.shape[0]):
    for c in range(data2.shape[1]):
        if np.random.random() < 0.25:
            data2[r, c] = np.nan
data_frame_fillna = pd.DataFrame(data2, row2, col2)
data_frame_fillna.info()
data_frame_fillna.describe()

In [ ]:
data_frame_fillna

In [ ]:
data_frame_fillna.fillna(method="ffill", inplace=True)

In [ ]:
data_frame_fillna

In [ ]:
data_frame_fillna.info()
data_frame_fillna.describe()

### replace
Uma das alternativas mais adequadas para trabalhar com valores ausentes ou inadequados é utilizando a função [`replace`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.replace.html). Esta função trabalha de forma semelhante a `dropna` e `filna` porém agora podemos indicar qual ou quais valores queremos substituir. A sintaxe para o funcionamento deste método é:

```python
DataFrame.replace(to_replace=None, value=None, inplace=False, limit=None, regex=False, method='pad')
```

In [ ]:
# Vamos contiuar com data_frame_nan
data_frame_nan

In [ ]:
# Observemos que temos varios valores Nan
data_frame_nan.replace(to_replace=np.nan, value=10)

In [ ]:
# Podemos passar uma lista de valores para ser subtituido
data_frame_nan.replace(to_replace=[np.nan, 8], value=10)

In [ ]:
# E também uma lista de valores para substuir
data_frame_nan.replace(to_replace=[np.nan, 8], value=[100, 80])

In [ ]:
# Voltando ao exemplo do sensor de temperatura
np.random.seed(100)
n = 1440 # Equivalente a coleta de pontos cada 60 segundos por 24 h
r_n = 3
err = [10, 15, 20, 40, 35]
data2 = np.random.uniform(27, 33, (n, r_n)).astype(object)
col2 = [f"Reactor_{i}" for i in range(1, r_n + 1)]
row2 = [f"Time_{i}" for i in range(1, n + 1)]
for r in range(data2.shape[0]):
    for c in range(data2.shape[1]):
        if np.random.random() < 0.25:
            data2[r, c] = np.nan
        elif np.random.random() < 0.1:
            data2[r, c] = np.random.choice(err)
data_frame_replace = pd.DataFrame(data2, row2, col2)

In [ ]:
data_frame_replace

In [ ]:
import matplotlib.pyplot as plt
%matplotlib nbagg
for react in data_frame_replace.columns:
    fig, ax = plt.subplots()
    ax.plot(data_frame_replace[react].values,
             ls="-",
             c='black',
             marker="o", 
             markersize=1.0,
             markeredgecolor='blue',
             lw=0.1)
    ax.set_xlabel("Time")
    ax.set_ylabel("Temperature [°C]")
    ax.set_title(react)

In [ ]:
data_frame_replace.replace(to_replace=[40, 35, 20, 15, 10, np.nan], value=data_frame_replace.mean().mean(), inplace=True)

## Groupby, aggregate e apply
Quando trabalhamos com dados qualitativos nominais pode ser necessário realizar agrupamentos e aplicar funções neste grupo de dados para conseguir entender melhor nosso sistema. Panda oferece uma serie de funções que ajudam a realizar isso. Cabe destacar que o potencial de Pandas está no uso em conjunto destas funções e outras.

---

A função [`groupby`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.groupby.html) é umas das função **mais importantes** da biblioteca Pandas devido a que permite realizar o agrupamento de grande quantidade de dados e aplicar funções sobre esses valores agrupados de forma rápida. Para aplicar essa função utilizamos a seguinte sintaxe:
```python
DataFrame.groupby(by=None, axis=0, level=None, as_index=True, sort=True, group_keys=True, squeeze=<object object>, observed=False, dropna=True)
```

---

A função [`aggregate`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.aggregate.html) permite aplicar uma (ou mais funções) sobre uma(s) coluna(s) ou fila(s).

**Observações**:
- Podem ser aplicadas funções `built-in function`, `lambda functions` ou funções criadas por nós;
- Podem ser aplicadas diferentes quantidades e tipos de funções para diferentes colunas ou filas do mesmo DataFrame;
- Ao momento de passar a funções não é necessário realizar a chamada da função.

A sintaxe utilizada para aplicar esta função é:
```python
DataFrame.aggregate(func=None, axis=0, *args, **kwargs)
```
***Recomendo ler a [documentação da função aggregate](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.aggregate.html) para conseguir entender melhor seu funcionamento***.

---

A função [`apply`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.apply.html) permite aplicar **UMA FUNÇÃO** sobre uma Series ou um DataFrame, especificando ou eixo onde dever ser aplicada a função.

**Observações**:
- Podem ser aplicadas funções `built-in function`,  `lambda functions` ou funções criadas por nós;
- Ao momento de passar a funções não é necessário realizar a chamada da função.

A sintaxe para utilizar esta função é:

```python
DataFrame.apply(func, axis=0, raw=False, result_type=None, args=(), **kwds)
```
***Recomendo ler a [documentação da função apply](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.apply.html) para conseguir entender melhor seu funcionamento***.

In [ ]:
# Para entender o funcionamento da função groupby vamos a criar uma matrix de dados
n = 1500
np.random.seed(100)
empresas = [f"Empresa {np.random.randint(1, 51)}" for _ in range(n)]
valor_investido = [np.random.uniform(500, 3500) for _ in range(n)]
retorno = [np.random.uniform(2000, 5000) for _ in range(n)]
transferencias = [np.random.randint(50, 150) for _ in range(n)]
matriz = np.c_[valor_investido, retorno, transferencias]
colum = "Valor investido ($R), Retorno ($R), Transferencias".split(", ")
#-----------------------------------------------------------------------
# Criação do DataFrame
data_frame_groupby = pd.DataFrame(data=matriz, columns=colum )
data_frame_groupby["Lucro ($)"] = data_frame_groupby["Retorno ($R)"] - data_frame_groupby["Valor investido ($R)"]
data_frame_groupby["Empresas"] = empresas
data_frame_groupby

In [ ]:
data_frame_groupby["Empresas"].unique()

### Groupby

In [ ]:
# Para entender o conceito de Groupby, vamos agrupar os dados por empresas
dfgroupby = data_frame_groupby.groupby(by="Empresas")

In [ ]:
# Observemos que o retorno da função groupby é o endereço na memoria de um objeto
dfgroupby

In [ ]:
# Para conseguir visualizar o DataFrame, devemos aplicar uma função sobre os valores
dfgroupby.mean()

In [ ]:
# Podemos utilizar o groupby para realizar agrupamento por camadas
agrupamento_empr_trans = data_frame_groupby.groupby(["Empresas", "Transferencias"]).mean()
agrupamento_empr_trans

In [ ]:
agrupamento_trans_empr = data_frame_groupby.groupby(["Transferencias", "Empresas"]).mean()
agrupamento_trans_empr

In [ ]:
# E se queremos realizar filtragem ao momento de aplicar o filtro?
agrupamento_empr_trans[(agrupamento_empr_trans["Valor investido ($R)"]>1800) & 
                        (agrupamento_empr_trans["Lucro ($)"]>1500)]

In [ ]:
# Podemos utilizar algums metodos para potencializar o uso de groupby
data_frame_groupby.groupby(["Empresas"]).get_group(("Empresa 1"))

In [ ]:
data_frame_groupby.groupby(["Empresas", "Transferencias"]).get_group(("Empresa 1", 52))

### aggregate

In [ ]:
# podemos aplicar aggreagate para um groupby de dois niveis

# pd.set_option('display.max_rows', 10)
dfgroupby.aggregate({"Lucro ($)": [min, max, np.mean, np.std],
                     "Retorno ($R)": [min, max, np.mean, np.std],
                     "Transferencias": [min, max]})

In [ ]:
agrupamento_empr_trans.aggregate({"Lucro ($)": [min, max, np.mean, np.std],
                     "Retorno ($R)": [min, max, np.mean, np.std]})

### apply

In [ ]:
# Exemplo com dados de lingaugems de programação
pd.set_option('display.max_rows', 80)
df_ling = pd.read_csv("./Dados/programming_languages.csv")
df_ling

In [ ]:
df_lig_grop = df_ling.groupby(by="year")
df_lig_grop["language"]

In [ ]:
# Obtendo um dataframe com as linguagens criadas em cada
pd.set_option('display.max_rows', 50)
df_lig_grop["language"].apply(','.join)

In [ ]:
# Obtendo um dataframe com as linguagens criadas em cada
df_lig_grop["language"].apply(len).values
df_lig_grop["language"].apply(len).index.values

In [ ]:
import matplotlib.pyplot as plt
plt.plot(df_lig_grop["language"].apply(len).index.values,
         df_lig_grop["language"].apply(len).values,
        ls="",
        marker="s")

## Juntando DataFrames
Em algumas ocasiones pode ser necessário criar um DataFrame utilizando dois ou mais DataFrame já existentes. Panda facilita realizar estas operações utilizando as funções `concat`, `merge` e `join`.

### Concat
A função [`concat`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html) permite realizar a união de dois DataFrame. A união pode ser feita adicionando o DataFrame como uma série de colunas ou filas novas. Para aplicar está funções se aplica a seguinte sintaxe:

```python
pandas.concat(objs: Union[Iterable[FrameOrSeries], Mapping[Label, FrameOrSeries]], axis='0', join: str = "'outer'", ignore_index: bool = 'False', keys='None', levels='None', names='None', verify_integrity: bool = 'False', sort: bool = 'False', copy: bool = 'True')
```
Cabe destacar que esse método é próprio das `series` e dos `DataFrame`

In [3]:
data = np.arange(1, 10).reshape((3, 3))
columnas = [f"Col {i}" for i in range(1, 4)]
data_frame_1 = pd.DataFrame(data=data, columns=columnas)
data_frame_2 = pd.DataFrame(data=data, columns=columnas)*10
data_frame_3 = pd.DataFrame(data=data, columns=columnas)*100

In [4]:
data_frame_1

   Col 1  Col 2  Col 3
0      1      2      3
1      4      5      6
2      7      8      9

In [23]:
data_frame_2

   Col 1  Col 2  Col 3
3     10     20     30
4     40     50     60
5     70     80     90

In [22]:
data_frame_3

   Col 1  Col 2  Col 3
6    100    200    300
7    400    500    600
8    700    800    900

In [16]:
# Passando os DataFrame que queremos juntar
pd.concat([data_frame_2, data_frame_3, data_frame_1])

   Col 1  Col 2  Col 3
0     10     20     30
1     40     50     60
2     70     80     90
0    100    200    300
1    400    500    600
2    700    800    900
0      1      2      3
1      4      5      6
2      7      8      9

In [17]:
# observemos que os índices foram mantidos para os DataFrame original
# Se queremos “reiniciar” os índices passamos o argumento
pd.concat([data_frame_1, data_frame_2, data_frame_3], ignore_index='False')

   Col 1  Col 2  Col 3
0      1      2      3
1      4      5      6
2      7      8      9
3     10     20     30
4     40     50     60
5     70     80     90
6    100    200    300
7    400    500    600
8    700    800    900

In [18]:
# Como vimos na reunião passada podemos passar o argumento axis para definir sobre qual eixo queremos realizar a operação
pd.concat([data_frame_1, data_frame_2, data_frame_3], axis=0)

   Col 1  Col 2  Col 3
0      1      2      3
1      4      5      6
2      7      8      9
0     10     20     30
1     40     50     60
2     70     80     90
0    100    200    300
1    400    500    600
2    700    800    900

In [19]:
pd.concat([data_frame_1, data_frame_2, data_frame_3], axis=1)

   Col 1  Col 2  Col 3  Col 1  Col 2  Col 3  Col 1  Col 2  Col 3
0      1      2      3     10     20     30    100    200    300
1      4      5      6     40     50     60    400    500    600
2      7      8      9     70     80     90    700    800    900

In [24]:
# O que acontece quando os index dos DataFrame são diferentes?
data_frame_2.index = pd.RangeIndex(start=3, stop=6, step=1)
data_frame_3.index = pd.RangeIndex(start=6, stop=9, step=1)
pd.concat([data_frame_1, data_frame_2, data_frame_3], axis=1)

   Col 1  Col 2  Col 3  Col 1  Col 2  Col 3  Col 1  Col 2  Col 3
0    1.0    2.0    3.0    NaN    NaN    NaN    NaN    NaN    NaN
1    4.0    5.0    6.0    NaN    NaN    NaN    NaN    NaN    NaN
2    7.0    8.0    9.0    NaN    NaN    NaN    NaN    NaN    NaN
3    NaN    NaN    NaN   10.0   20.0   30.0    NaN    NaN    NaN
4    NaN    NaN    NaN   40.0   50.0   60.0    NaN    NaN    NaN
5    NaN    NaN    NaN   70.0   80.0   90.0    NaN    NaN    NaN
6    NaN    NaN    NaN    NaN    NaN    NaN  100.0  200.0  300.0
7    NaN    NaN    NaN    NaN    NaN    NaN  400.0  500.0  600.0
8    NaN    NaN    NaN    NaN    NaN    NaN  700.0  800.0  900.0

### merge
Pode ser necessário realizar a união de duas tabelas que compartem os elementos de uma coluna, neste caso a função `concat` não é a mais indicada. Pandas possui o método [`marge`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html) que realiza a junção de duas tabelas mesclando os elementos que compartilham a mesma coluna. A sintaxe para ralizar essa operação é:
```python
DataFrame.merge(right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=False, suffixes='_x', '_y', copy=True, indicator=False, validate=None)
```

In [25]:
# Modificando os DataFrame
data_frame_1["coluna em comum"] = "A B C".split(" ")
data_frame_2["coluna em comum"] = "A C B".split(" ")

In [26]:
data_frame_1

   Col 1  Col 2  Col 3 coluna em comum
0      1      2      3               A
1      4      5      6               B
2      7      8      9               C

In [27]:
data_frame_2

   Col 1  Col 2  Col 3 coluna em comum
3     10     20     30               A
4     40     50     60               C
5     70     80     90               B

In [28]:
pd.merge(data_frame_1, data_frame_2, on="coluna em comum")

   Col 1_x  Col 2_x  Col 3_x coluna em comum  Col 1_y  Col 2_y  Col 3_y
0        1        2        3               A       10       20       30
1        4        5        6               B       70       80       90
2        7        8        9               C       40       50       60

In [29]:
# Podemos passar mais de uma coluna em comum
data_frame_1["coluna em comum 2"] = "X O I".split(" ")
data_frame_2["coluna em comum 2"] = "Q I X".split(" ")

In [30]:
data_frame_1

   Col 1  Col 2  Col 3 coluna em comum coluna em comum 2
0      1      2      3               A                 X
1      4      5      6               B                 O
2      7      8      9               C                 I

In [31]:
data_frame_2

   Col 1  Col 2  Col 3 coluna em comum coluna em comum 2
3     10     20     30               A                 Q
4     40     50     60               C                 I
5     70     80     90               B                 X

In [32]:
pd.merge(data_frame_1, data_frame_2, on=["coluna em comum", "coluna em comum 2"])

,Col 1_x,Col 2_x,Col 3_x,coluna em comum,coluna em comum 2,Col 1_y,Col 2_y,Col 3_y
0,7,8,9,C,I,40,50,60

In [33]:
pd.merge(data_frame_1, data_frame_2, on=["coluna em comum", "coluna em comum 2"], how="left")

,Col 1_x,Col 2_x,Col 3_x,coluna em comum,coluna em comum 2,Col 1_y,Col 2_y,Col 3_y
0,1,2,3,A,X,NaN,NaN,NaN
1,4,5,6,B,O,NaN,NaN,NaN
2,7,8,9,C,I,40.0,50.0,60.0

In [34]:
pd.merge(data_frame_1, data_frame_2, on=["coluna em comum", "coluna em comum 2"], how="right")

,Col 1_x,Col 2_x,Col 3_x,coluna em comum,coluna em comum 2,Col 1_y,Col 2_y,Col 3_y
0,NaN,NaN,NaN,A,Q,10,20,30
1,7.0,8.0,9.0,C,I,40,50,60
2,NaN,NaN,NaN,B,X,70,80,90

In [35]:
pd.merge(data_frame_1, data_frame_2, on=["coluna em comum", "coluna em comum 2"], how="outer")

,Col 1_x,Col 2_x,Col 3_x,coluna em comum,coluna em comum 2,Col 1_y,Col 2_y,Col 3_y
0,1.0,2.0,3.0,A,X,NaN,NaN,NaN
1,4.0,5.0,6.0,B,O,NaN,NaN,NaN
2,7.0,8.0,9.0,C,I,40.0,50.0,60.0
3,NaN,NaN,NaN,A,Q,10.0,20.0,30.0
4,NaN,NaN,NaN,B,X,70.0,80.0,90.0

In [36]:
pd.merge(data_frame_1, data_frame_2, on=["coluna em comum", "coluna em comum 2"], how="inner")

,Col 1_x,Col 2_x,Col 3_x,coluna em comum,coluna em comum 2,Col 1_y,Col 2_y,Col 3_y
0,7,8,9,C,I,40,50,60

### join
Pode ser necessário combinar DataFrames que possam compartilhar os mesmos índices, neste caso as funções `concat` e `merge` não são as mais adequadas. Para resolver esses problemas os DataFrame pandas possuem o método [`join`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.join.html) o qual consegue juntar DataFrame avaliando as semelhanças entre os índices. A sintaxe utilizada é:
```python
DataFrame.join(other, on=None, how='left', lsuffix='', rsuffix='', sort=False)
```

In [37]:
data_frame_1.index = 1, 2, 3
data_frame_2.index = 3, 1, 4

In [38]:
data_frame_1

   Col 1  Col 2  Col 3 coluna em comum coluna em comum 2
1      1      2      3               A                 X
2      4      5      6               B                 O
3      7      8      9               C                 I

In [39]:
data_frame_2

   Col 1  Col 2  Col 3 coluna em comum coluna em comum 2
3     10     20     30               A                 Q
1     40     50     60               C                 I
4     70     80     90               B                 X

In [40]:
data_frame_1.join(data_frame_2, lsuffix=' Original')

,Col 1 Original,Col 2 Original,Col 3 Original,coluna em comum Original,coluna em comum 2 Original,Col 1,Col 2,Col 3,coluna em comum,coluna em comum 2
1,1,2,3,A,X,40.0,50.0,60.0,C,I
2,4,5,6,B,O,NaN,NaN,NaN,NaN,NaN
3,7,8,9,C,I,10.0,20.0,30.0,A,Q

In [ ]:
# Neste método temos o parâmetro how que modifica a forma de ralizar a união

In [41]:
data_frame_1.join(data_frame_2, lsuffix=' Original', how="left")

,Col 1 Original,Col 2 Original,Col 3 Original,coluna em comum Original,coluna em comum 2 Original,Col 1,Col 2,Col 3,coluna em comum,coluna em comum 2
1,1,2,3,A,X,40.0,50.0,60.0,C,I
2,4,5,6,B,O,NaN,NaN,NaN,NaN,NaN
3,7,8,9,C,I,10.0,20.0,30.0,A,Q

In [42]:
data_frame_1.join(data_frame_2, lsuffix=' Original', how="right")

,Col 1 Original,Col 2 Original,Col 3 Original,coluna em comum Original,coluna em comum 2 Original,Col 1,Col 2,Col 3,coluna em comum,coluna em comum 2
3,7.0,8.0,9.0,C,I,10,20,30,A,Q
1,1.0,2.0,3.0,A,X,40,50,60,C,I
4,NaN,NaN,NaN,NaN,NaN,70,80,90,B,X

In [43]:
data_frame_1.join(data_frame_2, lsuffix=' Original', how="inner")

,Col 1 Original,Col 2 Original,Col 3 Original,coluna em comum Original,coluna em comum 2 Original,Col 1,Col 2,Col 3,coluna em comum,coluna em comum 2
1,1,2,3,A,X,40,50,60,C,I
3,7,8,9,C,I,10,20,30,A,Q

In [44]:
data_frame_1.join(data_frame_2, lsuffix=' Original', how="outer")

,Col 1 Original,Col 2 Original,Col 3 Original,coluna em comum Original,coluna em comum 2 Original,Col 1,Col 2,Col 3,coluna em comum,coluna em comum 2
1,1.0,2.0,3.0,A,X,40.0,50.0,60.0,C,I
2,4.0,5.0,6.0,B,O,NaN,NaN,NaN,NaN,NaN
3,7.0,8.0,9.0,C,I,10.0,20.0,30.0,A,Q
4,NaN,NaN,NaN,NaN,NaN,70.0,80.0,90.0,B,X

##  Operações

### unique

O método [`unique`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.unique.html) mostra os valores únicos contidos numa `Series`. Esses valores são mostrados em ordem de ocorrência. A sintaxe para utilizar este método é:

```python
pandas.unique(values)
```

In [45]:
# Forma de ser usado 1
data_frame_nan["Col_1"].unique()

array([-2, -8, -6, nan, 6, 7, -10, -7, 8], dtype=object)

In [46]:
data_frame_nan

       Col_1 Col_2 Col_3 Col_4 Col_5 Col_6 Col_7 Col_8 Col_9 Col_10
Row_1     -2    -7   NaN     5     6     0    -8    -8    -8      4
Row_2     -8     7     6   NaN    -6     1     6    -1    -8    NaN
Row_3     -6    -9     3     9    -6    -6    -7    -3     7      5
Row_4    NaN   NaN   NaN     6    -8   NaN     9    -8     4      7
Row_5      6     5    -3     3   NaN     2     8   -10    -8      0
Row_6      7   NaN     3     0   NaN   NaN     8    -2     9      4
Row_7    -10   NaN     2     0   NaN    -4   NaN     5     0    NaN
Row_8     -7   NaN     6     1    -6    -5    -3    -4    -8      0
Row_9      8   NaN     2    -9    -4     0   -10    -8     9     -6
Row_10     8   NaN   NaN    -1   NaN     6    -4    -5   NaN    NaN

In [48]:
# Forma de ser usado 2
pd.unique(data_frame_nan["Col_1"])

array([-2, -8, -6, nan, 6, 7, -10, -7, 8], dtype=object)

### nunique
O método [`nunique`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.nunique.html) retorna o quantidades de ocorrências únicas numa `Series`. A sintaxe para utilizar esse método é:
```python
DataFrame.nunique(axis=0, dropna=True)
```

In [49]:
data_frame_nan

       Col_1 Col_2 Col_3 Col_4 Col_5 Col_6 Col_7 Col_8 Col_9 Col_10
Row_1     -2    -7   NaN     5     6     0    -8    -8    -8      4
Row_2     -8     7     6   NaN    -6     1     6    -1    -8    NaN
Row_3     -6    -9     3     9    -6    -6    -7    -3     7      5
Row_4    NaN   NaN   NaN     6    -8   NaN     9    -8     4      7
Row_5      6     5    -3     3   NaN     2     8   -10    -8      0
Row_6      7   NaN     3     0   NaN   NaN     8    -2     9      4
Row_7    -10   NaN     2     0   NaN    -4   NaN     5     0    NaN
Row_8     -7   NaN     6     1    -6    -5    -3    -4    -8      0
Row_9      8   NaN     2    -9    -4     0   -10    -8     9     -6
Row_10     8   NaN   NaN    -1   NaN     6    -4    -5   NaN    NaN

In [50]:
# Utilizando função sem passar nenhum tipo de parâmetro
data_frame_nan.nunique()
# Observemos que os valores Nan não são considerados

Col_1     8
Col_2     4
Col_3     4
Col_4     8
Col_5     4
Col_6     7
Col_7     8
Col_8     8
Col_9     5
Col_10    5
dtype: int64

In [53]:
# Utilizando utilizando o parâmetro dropna
data_frame_nan.nunique(dropna=False)
# Observemos que os valores Nan são considerados

Col_1     9
Col_2     5
Col_3     5
Col_4     9
Col_5     5
Col_6     8
Col_7     9
Col_8     8
Col_9     6
Col_10    6
dtype: int64

In [54]:
# Utilizando utilizando o parâmetro axis
data_frame_nan.nunique(axis=1, dropna=False)

Row_1      8
Row_2      7
Row_3      8
Row_4      6
Row_5     10
Row_6      8
Row_7      6
Row_8     10
Row_9     10
Row_10     6
dtype: int64

### value_counts
A função [`value_counts`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.value_counts.html) retorna uma `Series` com todos os valores e o número de ocorrências de cada valor. A sintaxe para utilizar essa função é
```python
Series.value_counts(normalize=False, sort=True, ascending=False, bins=None, dropna=True)
```

In [55]:
#  Utilizando a função com o parâmetro sort
data_frame_nan["Col_1"].value_counts()

 8     2
-2     1
-6     1
-7     1
-8     1
 7     1
 6     1
-10    1
Name: Col_1, dtype: int64

In [62]:
# Utilizando a função com o parâmetro sort e normalize
data_frame_nan["Col_3"].value_counts(sort=True, normalize=True)

 6    0.285714
 3    0.285714
 2    0.285714
-3    0.142857
Name: Col_3, dtype: float64

In [66]:
# Utilizando a função com o parâmetro sort, normalize, dropna
data_frame_nan["Col_3"].value_counts(sort=True, normalize=True, dropna=False)

 NaN    0.3
 6.0    0.2
 3.0    0.2
 2.0    0.2
-3.0    0.1
Name: Col_3, dtype: float64

In [ ]:
# Utilizando a função com argumento sort nenhum tipo de parâmetro
data_frame_nan["Col_3"].value_counts(sort=True)

### del

`del` não é uma função ou método próprio de Pandas. Porém podemos usar ele para eliminar colunas de forma rápida. A sintaxe para realizar isso é:
```python
del nome_DataFrame[‘Nome_da_coluna_a_ser_eliminada’]
```

In [67]:
data_frame_nan

       Col_1 Col_2 Col_3 Col_4 Col_5 Col_6 Col_7 Col_8 Col_9 Col_10
Row_1     -2    -7   NaN     5     6     0    -8    -8    -8      4
Row_2     -8     7     6   NaN    -6     1     6    -1    -8    NaN
Row_3     -6    -9     3     9    -6    -6    -7    -3     7      5
Row_4    NaN   NaN   NaN     6    -8   NaN     9    -8     4      7
Row_5      6     5    -3     3   NaN     2     8   -10    -8      0
Row_6      7   NaN     3     0   NaN   NaN     8    -2     9      4
Row_7    -10   NaN     2     0   NaN    -4   NaN     5     0    NaN
Row_8     -7   NaN     6     1    -6    -5    -3    -4    -8      0
Row_9      8   NaN     2    -9    -4     0   -10    -8     9     -6
Row_10     8   NaN   NaN    -1   NaN     6    -4    -5   NaN    NaN

In [68]:
del data_frame_nan["Col_6"]

In [69]:
data_frame_nan

       Col_1 Col_2 Col_3 Col_4 Col_5 Col_7 Col_8 Col_9 Col_10
Row_1     -2    -7   NaN     5     6    -8    -8    -8      4
Row_2     -8     7     6   NaN    -6     6    -1    -8    NaN
Row_3     -6    -9     3     9    -6    -7    -3     7      5
Row_4    NaN   NaN   NaN     6    -8     9    -8     4      7
Row_5      6     5    -3     3   NaN     8   -10    -8      0
Row_6      7   NaN     3     0   NaN     8    -2     9      4
Row_7    -10   NaN     2     0   NaN   NaN     5     0    NaN
Row_8     -7   NaN     6     1    -6    -3    -4    -8      0
Row_9      8   NaN     2    -9    -4   -10    -8     9     -6
Row_10     8   NaN   NaN    -1   NaN    -4    -5   NaN    NaN

### columns
O método `columns` retorna os labels do `DataFrame`. A sintaxe para utilizar este método é:
```python
DataFrame.columns
```

In [70]:
data_frame_nan.columns

Index(['Col_1', 'Col_2', 'Col_3', 'Col_4', 'Col_5', 'Col_7', 'Col_8', 'Col_9',
       'Col_10'],
      dtype='object')

### index
O método `index` retorna os índices (labels das filas) do `DataFrame`. A sintaxe para utilizar este método é:
```python
DataFrame.index
```

In [71]:
data_frame_nan.index

Index(['Row_1', 'Row_2', 'Row_3', 'Row_4', 'Row_5', 'Row_6', 'Row_7', 'Row_8',
       'Row_9', 'Row_10'],
      dtype='object')

### sort_values

A função [`sort_values`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sort_values.html) organiza um DataFrame por colunas ou filas. Está função permite organizar os DataFrame por varias colunas ou filas ao mesmo tempo. A sintaxe para aplicar essa função é:
```python
DataFrame.sort_values(by, axis=0, ascending=True, inplace=False, kind='quicksort', na_position='last', ignore_index=False, key=None)
```

In [72]:
data_frame_nan

       Col_1 Col_2 Col_3 Col_4 Col_5 Col_7 Col_8 Col_9 Col_10
Row_1     -2    -7   NaN     5     6    -8    -8    -8      4
Row_2     -8     7     6   NaN    -6     6    -1    -8    NaN
Row_3     -6    -9     3     9    -6    -7    -3     7      5
Row_4    NaN   NaN   NaN     6    -8     9    -8     4      7
Row_5      6     5    -3     3   NaN     8   -10    -8      0
Row_6      7   NaN     3     0   NaN     8    -2     9      4
Row_7    -10   NaN     2     0   NaN   NaN     5     0    NaN
Row_8     -7   NaN     6     1    -6    -3    -4    -8      0
Row_9      8   NaN     2    -9    -4   -10    -8     9     -6
Row_10     8   NaN   NaN    -1   NaN    -4    -5   NaN    NaN

In [77]:
# Só utilizando o parâmetro by e ordenando somente por uma coluna
data_frame_nan.sort_values(by="Col_3", ascending=False, na_position='first')

       Col_1 Col_2 Col_3 Col_4 Col_5 Col_7 Col_8 Col_9 Col_10
Row_1     -2    -7   NaN     5     6    -8    -8    -8      4
Row_4    NaN   NaN   NaN     6    -8     9    -8     4      7
Row_10     8   NaN   NaN    -1   NaN    -4    -5   NaN    NaN
Row_2     -8     7     6   NaN    -6     6    -1    -8    NaN
Row_8     -7   NaN     6     1    -6    -3    -4    -8      0
Row_3     -6    -9     3     9    -6    -7    -3     7      5
Row_6      7   NaN     3     0   NaN     8    -2     9      4
Row_7    -10   NaN     2     0   NaN   NaN     5     0    NaN
Row_9      8   NaN     2    -9    -4   -10    -8     9     -6
Row_5      6     5    -3     3   NaN     8   -10    -8      0

In [74]:
# Só utilizando o parâmetro by e ordenando somente por duas colunas
data_frame_nan.sort_values(by=["Col_3", "Col_4"])

       Col_1 Col_2 Col_3 Col_4 Col_5 Col_7 Col_8 Col_9 Col_10
Row_5      6     5    -3     3   NaN     8   -10    -8      0
Row_9      8   NaN     2    -9    -4   -10    -8     9     -6
Row_7    -10   NaN     2     0   NaN   NaN     5     0    NaN
Row_6      7   NaN     3     0   NaN     8    -2     9      4
Row_3     -6    -9     3     9    -6    -7    -3     7      5
Row_8     -7   NaN     6     1    -6    -3    -4    -8      0
Row_2     -8     7     6   NaN    -6     6    -1    -8    NaN
Row_10     8   NaN   NaN    -1   NaN    -4    -5   NaN    NaN
Row_1     -2    -7   NaN     5     6    -8    -8    -8      4
Row_4    NaN   NaN   NaN     6    -8     9    -8     4      7

In [78]:
# Organizando o vetor por filas
data_frame_nan.sort_values(by=["Row_2"], axis=1)

       Col_1 Col_9 Col_5 Col_8 Col_3 Col_7 Col_2 Col_4 Col_10
Row_1     -2    -8     6    -8   NaN    -8    -7     5      4
Row_2     -8    -8    -6    -1     6     6     7   NaN    NaN
Row_3     -6     7    -6    -3     3    -7    -9     9      5
Row_4    NaN     4    -8    -8   NaN     9   NaN     6      7
Row_5      6    -8   NaN   -10    -3     8     5     3      0
Row_6      7     9   NaN    -2     3     8   NaN     0      4
Row_7    -10     0   NaN     5     2   NaN   NaN     0    NaN
Row_8     -7    -8    -6    -4     6    -3   NaN     1      0
Row_9      8     9    -4    -8     2   -10   NaN    -9     -6
Row_10     8   NaN   NaN    -5   NaN    -4   NaN    -1    NaN

In [79]:
# Organizando o vetor por filas
data_frame_nan.sort_values(by=["Row_2", "Row_3"], axis=1)

       Col_1 Col_9 Col_5 Col_8 Col_7 Col_3 Col_2 Col_10 Col_4
Row_1     -2    -8     6    -8    -8   NaN    -7      4     5
Row_2     -8    -8    -6    -1     6     6     7    NaN   NaN
Row_3     -6     7    -6    -3    -7     3    -9      5     9
Row_4    NaN     4    -8    -8     9   NaN   NaN      7     6
Row_5      6    -8   NaN   -10     8    -3     5      0     3
Row_6      7     9   NaN    -2     8     3   NaN      4     0
Row_7    -10     0   NaN     5   NaN     2   NaN    NaN     0
Row_8     -7    -8    -6    -4    -3     6   NaN      0     1
Row_9      8     9    -4    -8   -10     2   NaN     -6    -9
Row_10     8   NaN   NaN    -5    -4   NaN   NaN    NaN    -1

### pivot

O método [`pivot`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.pivot.html) é um dos métodos mais simples de Pandas, mas ao mesmo tempo, um dos mais usados e mais poderosos (mais um). Esse método está no mesmo nível que `groupby` e `aggregate`. Esse método se encarrega de reestruturar a um DataFrame. A sintaxe para aplicar esse método é:
```python
DataFrame.pivot(index=None, columns=None, values=None)
```

In [80]:
data_url = 'http://bit.ly/2cLzoxH'
data_frame_exemple = pd.read_csv(data_url)
data_frame_exemple

          country  year         pop continent  lifeExp   gdpPercap
0     Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1     Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2     Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3     Afghanistan  1967  11537966.0      Asia   34.020  836.197138
4     Afghanistan  1972  13079460.0      Asia   36.088  739.981106
...           ...   ...         ...       ...      ...         ...
1699     Zimbabwe  1987   9216418.0    Africa   62.351  706.157306
1700     Zimbabwe  1992  10704340.0    Africa   60.377  693.420786
1701     Zimbabwe  1997  11404948.0    Africa   46.809  792.449960
1702     Zimbabwe  2002  11926563.0    Africa   39.989  672.038623
1703     Zimbabwe  2007  12311143.0    Africa   43.487  469.709298

[1704 rows x 6 columns]

In [81]:
# Re-estruturando o dataframe
data_frame_exemple.pivot(index="country", columns="year", values="lifeExp")

year,1952,1957,1962,1967,1972,1977,1982,1987,1992,1997,2002,2007
country,,,,,,,,,,,,
Afghanistan,28.801,30.332,31.997,34.020,36.088,38.438,39.854,40.822,41.674,41.763,42.129,43.828
Albania,55.230,59.280,64.820,66.220,67.690,68.930,70.420,72.000,71.581,72.950,75.651,76.423
Algeria,43.077,45.685,48.303,51.407,54.518,58.014,61.368,65.799,67.744,69.152,70.994,72.301
Angola,30.015,31.999,34.000,35.985,37.928,39.483,39.942,39.906,40.647,40.963,41.003,42.731
Argentina,62.485,64.399,65.142,65.634,67.065,68.481,69.942,70.774,71.868,73.275,74.340,75.320
...,...,...,...,...,...,...,...,...,...,...,...,...
Vietnam,40.412,42.887,45.363,47.838,50.254,55.764,58.816,62.820,67.662,70.672,73.017,74.249
West Bank and Gaza,43.160,45.671,48.127,51.631,56.532,60.765,64.406,67.046,69.718,71.096,72.370,73.422
Yemen Rep.,32.548,33.970,35.180,36.984,39.848,44.175,49.113,52.922,55.599,58.020,60.308,62.698
Zambia,42.038,44.077,46.023,47.768,50.107,51.386,51.821,50.821,46.100,40.238,39.193,42.384
Zimbabwe,48.451,50.469,52.358,53.995,55.635,57.674,60.363,62.351,60.377,46.809,39.989,43.487

In [82]:
# Re-estruturando o dataframe, trabalhando com dois index
data_frame_exemple.pivot(index=["country", "continent"], columns="year", values="lifeExp")

,year,1952,1957,1962,1967,1972,1977,1982,1987,1992,1997,2002,2007
country,continent,,,,,,,,,,,,
Afghanistan,Asia,28.801,30.332,31.997,34.020,36.088,38.438,39.854,40.822,41.674,41.763,42.129,43.828
Albania,Europe,55.230,59.280,64.820,66.220,67.690,68.930,70.420,72.000,71.581,72.950,75.651,76.423
Algeria,Africa,43.077,45.685,48.303,51.407,54.518,58.014,61.368,65.799,67.744,69.152,70.994,72.301
Angola,Africa,30.015,31.999,34.000,35.985,37.928,39.483,39.942,39.906,40.647,40.963,41.003,42.731
Argentina,Americas,62.485,64.399,65.142,65.634,67.065,68.481,69.942,70.774,71.868,73.275,74.340,75.320
...,...,...,...,...,...,...,...,...,...,...,...,...,...
Vietnam,Asia,40.412,42.887,45.363,47.838,50.254,55.764,58.816,62.820,67.662,70.672,73.017,74.249
West Bank and Gaza,Asia,43.160,45.671,48.127,51.631,56.532,60.765,64.406,67.046,69.718,71.096,72.370,73.422
Yemen Rep.,Asia,32.548,33.970,35.180,36.984,39.848,44.175,49.113,52.922,55.599,58.020,60.308,62.698
Zambia,Africa,42.038,44.077,46.023,47.768,50.107,51.386,51.821,50.821,46.100,40.238,39.193,42.384
Zimbabwe,Africa,48.451,50.469,52.358,53.995,55.635,57.674,60.363,62.351,60.377,46.809,39.989,43.487

In [84]:
# Re-estruturando o dataframe, trabalhando com dois index
data_frame_exemple.pivot(index=["continent", "country"], columns="year", values=["lifeExp", "pop"])

                         lifeExp                                          \
year                        1952    1957    1962    1967    1972    1977
continent country
Africa    Algeria         43.077  45.685  48.303  51.407  54.518  58.014
          Angola          30.015  31.999  34.000  35.985  37.928  39.483
          Benin           38.223  40.358  42.618  44.885  47.014  49.190
          Botswana        47.622  49.618  51.520  53.298  56.024  59.319
          Burkina Faso    31.975  34.906  37.814  40.697  43.591  46.137
...                          ...     ...     ...     ...     ...     ...
Europe    Switzerland     69.620  70.560  71.320  72.770  73.780  75.390
          Turkey          43.585  48.079  52.098  54.336  57.005  59.507
          United Kingdom  69.180  70.420  70.760  71.360  72.010  72.760
Oceania   Australia       69.120  70.330  70.930  71.100  71.930  73.490
          New Zealand     69.390  70.260  71.240  71.520  71.890  72.220

                                                          ...         pop  \
year                        1982    1987    1992    1997  ...        1962
continent country                                         ...
Africa    Algeria         61.368  65.799  67.744  69.152  ...  11000948.0
          Angola          39.942  39.906  40.647  40.963  ...   4826015.0
          Benin           50.904  52.337  53.919  54.777  ...   2151895.0
          Botswana        61.484  63.622  62.745  52.556  ...    512764.0
          Burkina Faso    48.122  49.557  50.260  50.324  ...   4919632.0
...                          ...     ...     ...     ...  ...         ...
Europe    Switzerland     76.210  77.410  78.030  79.370  ...   5666000.0
          Turkey          61.036  63.108  66.146  68.835  ...  29788695.0
          United Kingdom  74.040  75.007  76.420  77.218  ...  53292000.0
Oceania   Australia       74.740  76.320  77.560  78.830  ...  10794968.0
          New Zealand     73.840  74.320  76.330  77.550  ...   2488550.0

                                                                          \
year                            1967        1972        1977        1982
continent country
Africa    Algeria         12760499.0  14760787.0  17152804.0  20033753.0
          Angola           5247469.0   5894858.0   6162675.0   7016384.0
          Benin            2427334.0   2761407.0   3168267.0   3641603.0
          Botswana          553541.0    619351.0    781472.0    970347.0
          Burkina Faso     5127935.0   5433886.0   5889574.0   6634596.0
...                              ...         ...         ...         ...
Europe    Switzerland      6063000.0   6401400.0   6316424.0   6468126.0
          Turkey          33411317.0  37492953.0  42404033.0  47328791.0
          United Kingdom  54959000.0  56079000.0  56179000.0  56339704.0
Oceania   Australia       11872264.0  13177000.0  14074100.0  15184200.0
          New Zealand      2728150.0   2929100.0   3164900.0   3210650.0

                                                                          \
year                            1987        1992        1997        2002
continent country
Africa    Algeria         23254956.0  26298373.0  29072015.0  31287142.0
          Angola           7874230.0   8735988.0   9875024.0  10866106.0
          Benin            4243788.0   4981671.0   6066080.0   7026113.0
          Botswana         1151184.0   1342614.0   1536536.0   1630347.0
          Burkina Faso     7586551.0   8878303.0  10352843.0  12251209.0
...                              ...         ...         ...         ...
Europe    Switzerland      6649942.0   6995447.0   7193761.0   7361757.0
          Turkey          52881328.0  58179144.0  63047647.0  67308928.0
          United Kingdom  56981620.0  57866349.0  58808266.0  59912431.0
Oceania   Australia       16257249.0  17481977.0  18565243.0  19546792.0
          New Zealand      3317166.0   3437674.0   3676187.0   3908037.0


year                            2007
continent country
Africa    Algeria         33333216.0
          Angola          12420476.0
          Benin            8078314.0
          Botswana         1639131.0
          Burkina Faso    14326203.0
...                              ...
Europe    Switzerland      7554661.0
          Turkey          71158647.0
          United Kingdom  60776238.0
Oceania   Australia       20434176.0
          New Zealand      4115771.0

[142 rows x 24 columns]

### describe

A função [`describe`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.describe.html) apresenta as estatísticas de um DataFrame, sendo: média, desvio padrão, quartis, etc. A sintaxe para aplicar está função é:
```python
DataFrame.describe(percentiles=None, include=None, exclude=None, datetime_is_numeric=False)
```

In [85]:
data_frame_exemple.describe()

             year           pop      lifeExp      gdpPercap
count  1704.00000  1.704000e+03  1704.000000    1704.000000
mean   1979.50000  2.960121e+07    59.474439    7215.327081
std      17.26533  1.061579e+08    12.917107    9857.454543
min    1952.00000  6.001100e+04    23.599000     241.165877
25%    1965.75000  2.793664e+06    48.198000    1202.060309
50%    1979.50000  7.023596e+06    60.712500    3531.846989
75%    1993.25000  1.958522e+07    70.845500    9325.462346
max    2007.00000  1.318683e+09    82.603000  113523.132900

In [86]:
data_frame_nan.describe()

        Col_1  Col_2  Col_3  Col_4  Col_5  Col_7  Col_8  Col_9  Col_10
count       9      4      7      9      6      9     10      9       7
unique      8      4      4      8      4      8      8      5       5
top         8     -9      6      0     -6      8     -8     -8       4
freq        2      1      2      2      3      2      3      4       2

### info

O método [`info`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.info.html) apresenta um resumo do DataFrame. A sintaxe para aplicar esse método é:
```python
DataFrame.info(verbose=None, buf=None, max_cols=None, memory_usage=None, null_counts=None)
```

In [91]:
type(data_frame_exemple.iloc[0, 0])

str

In [87]:
data_frame_exemple.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   year       1704 non-null   int64
 2   pop        1704 non-null   float64
 3   continent  1704 non-null   object
 4   lifeExp    1704 non-null   float64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(3), int64(1), object(2)
memory usage: 80.0+ KB

In [92]:
data_frame_nan.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, Row_1 to Row_10
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Col_1   9 non-null      object
 1   Col_2   4 non-null      object
 2   Col_3   7 non-null      object
 3   Col_4   9 non-null      object
 4   Col_5   6 non-null      object
 5   Col_7   9 non-null      object
 6   Col_8   10 non-null     object
 7   Col_9   9 non-null      object
 8   Col_10  7 non-null      object
dtypes: object(9)
memory usage: 1.1+ KB

## Exportando e importando dados

Uma das habilidades mais relevantes de Pandas é a forma eficiente de escrever e transformar esses arquivos em DataFrame. A biblioteca pandas possui mais de 15 funções que realizam a leitura de arquivos e os transformam em `pandas.DataFrame`.

---
As funções que utilizaremos para leitura de arquivos são:
- `pd.read_csv()`
- `pd.read_excel()`
- `pd.read_html()`
- `pd.to_csv()`
- `pd.to_excel()`

### read_csv

A função [`pd.read_csv`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html) realiza a leitura de arquivos `.csv` ou `.txt` e os transforma em DataFrame. A sintaxe para utilizar está função é:
```python
pandas.read_csv(filepath_or_buffer, sep=',', delimiter=None, header='infer', names=None, index_col=None, usecols=None, squeeze=False, prefix=None, mangle_dupe_cols=True, dtype=None, engine=None, converters=None, true_values=None, false_values=None, skipinitialspace=False, skiprows=None, skipfooter=0, nrows=None, na_values=None, keep_default_na=True, na_filter=True, verbose=False, skip_blank_lines=True, parse_dates=False, infer_datetime_format=False, keep_date_col=False, date_parser=None, dayfirst=False, cache_dates=True, iterator=False, chunksize=None, compression='infer', thousands=None, decimal='.', lineterminator=None, quotechar='"', quoting=0, doublequote=True, escapechar=None, comment=None, encoding=None, dialect=None, error_bad_lines=True, warn_bad_lines=True, delim_whitespace=False, low_memory=True, memory_map=False, float_precision=None)
```
Como podemos observar esta função possui diversos parâmetros, porém o único parâmetro obrigatório é `filepath_or_buffer`, os outros parâmetros estão definidos por padrão. Mas devemos ter cuidado com o parâmetro `sep` o qual pude ser diferente ao valor padrão "`,`".

In [94]:
# Lendo um arquivo csv com separador padrão
arquivo_1 = pd.read_csv("./Dados/arquivo1.csv")
arquivo_1

,state,state_abbreviation,county,fips,party,candidate,votes,fraction_votes
0,Alabama,AL,Autauga,1001.0,Democrat,Bernie Sanders,544,0.182
1,Alabama,AL,Autauga,1001.0,Democrat,Hillary Clinton,2387,0.800
2,Alabama,AL,Baldwin,1003.0,Democrat,Bernie Sanders,2694,0.329
3,Alabama,AL,Baldwin,1003.0,Democrat,Hillary Clinton,5290,0.647
4,Alabama,AL,Barbour,1005.0,Democrat,Bernie Sanders,222,0.078
...,...,...,...,...,...,...,...,...
24606,Wyoming,WY,Teton-Sublette,95600028.0,Republican,Ted Cruz,0,0.000
24607,Wyoming,WY,Uinta-Lincoln,95600027.0,Republican,Donald Trump,0,0.000
24608,Wyoming,WY,Uinta-Lincoln,95600027.0,Republican,John Kasich,0,0.000
24609,Wyoming,WY,Uinta-Lincoln,95600027.0,Republican,Marco Rubio,0,0.000
24610,Wyoming,WY,Uinta-Lincoln,95600027.0,Republican,Ted Cruz,53,1.000

In [96]:
# Lendo mais um arquivo csv
arquivo_2 = pd.read_csv("./Dados/arquivo2.csv", header=None)
arquivo_2

,0,1,2,3,4,5,6,7,8,9,...,19,20,21,22,23,24,25,26,27,28
0,0.0,0.000,0.00,0.000,0.000,0.0000,0.0000,0.00,0.00,0.0000,...,0.00,0.00,0.0000,0.000,0.000,0.00,0.00,0.0000,0.0000,0.000
1,0.0,19.500,1.02,0.391,0.202,0.0350,0.0122,0.29,4.44,9.8300,...,4.37,2.27,0.1180,0.079,3.050,7.01,9.81,0.0481,0.5550,7.390
2,1.0,19.500,1.02,0.391,0.202,0.0350,0.0122,0.29,4.44,9.8300,...,4.37,2.27,0.1180,0.079,3.050,7.01,9.81,0.0481,0.5550,7.390
3,2.0,19.500,1.02,0.391,0.202,0.0350,0.0122,0.29,4.44,9.8300,...,4.37,2.27,0.1180,0.079,3.050,7.01,9.81,0.0481,0.5550,7.390
4,3.0,19.500,1.02,0.391,0.202,0.0350,0.0122,0.29,4.44,9.8300,...,4.37,2.27,0.1180,0.079,3.050,7.01,9.81,0.0481,0.5550,7.390
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8747,8750.0,0.743,1.86,0.349,0.396,0.0391,0.0147,2.62,5.73,0.5040,...,7.60,6.26,0.0732,0.109,0.941,9.52,1.98,0.0433,0.0287,0.226
8748,8750.0,0.743,1.86,0.349,0.396,0.0391,0.0147,2.62,5.73,0.5040,...,7.60,6.26,0.0732,0.109,0.941,9.52,1.98,0.0433,0.0287,0.226
8749,8750.0,0.743,1.86,0.349,0.396,0.0391,0.0147,2.62,5.73,0.5040,...,7.60,6.26,0.0732,0.109,0.941,9.52,1.98,0.0433,0.0287,0.226
8750,8750.0,0.743,1.86,0.349,0.396,0.0391,0.0147,2.62,5.73,0.5040,...,7.60,6.26,0.0732,0.109,0.941,9.52,1.98,0.0433,0.0287,0.226
8751,8750.0,0.723,1.62,0.330,0.405,0.0356,0.0140,2.83,4.47,0.0111,...,9.33,8.88,0.0768,0.109,0.775,9.56,1.41,0.0436,0.0251,0.174

In [98]:
# Lendo mais um arquivo csv
arquivo_3 = pd.read_csv("./Dados/arquivo3.csv", sep="-")
arquivo_3

    year                    language
0   1951  Regional Assembly Language
1   1952                    Autocode
2   1954                         IPL
3   1955                  FLOW MATIC
4   1957                     FORTRAN
..   ...                         ...
68  2011                      Kotlin
69  2011                         Red
70  2011                      Elixir
71  2012                       Julia
72  2014                       Swift

[73 rows x 2 columns]

### read_excel
A função [`read_excel`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_excel.html) permite a leitura de arquivos tipo excel. Vale  destacar que a as extensões permitidas são: xls, xlsx, xlsm, xlsb, odf, ods. A sintaxe para a utilizar esta função é:
```python
pandas.read_excel(io, sheet_name=0, header=0, names=None, index_col=None, usecols=None, squeeze=False, dtype=None, engine=None, converters=None, true_values=None, false_values=None, skiprows=None, nrows=None, na_values=None, keep_default_na=True, verbose=False, parse_dates=False, date_parser=None, thousands=None, comment=None, skip_footer=0, skipfooter=0, convert_float=True, mangle_dupe_cols=True, **kwds)
```

In [99]:
arquivo_4 = pd.read_excel(io="./Dados/arquivo4.xlsx")
arquivo_4

    year                    language
0   1951  Regional Assembly Language
1   1952                    Autocode
2   1954                         IPL
3   1955                  FLOW MATIC
4   1957                     FORTRAN
..   ...                         ...
68  2011                      Kotlin
69  2011                         Red
70  2011                      Elixir
71  2012                       Julia
72  2014                       Swift

[73 rows x 2 columns]

In [100]:
arquivo_5 = pd.read_excel(io="./Dados/arquivo5.xlsx")
arquivo_5

,0,0.1,0.2,0.3,0.4,0.5,0.6,0.7,0.8,0.9,...,0.19,0.20,0.21,0.22,0.23,0.24,0.25,0.26,0.27,0.28
0,0,19.459274,1.019596,0.391095,0.202314,0.035023,0.012180,0.290197,4.440008,9.828326,...,4.370077,2.266101,0.117615,0.078961,3.053336,7.006424,9.814404,0.048076,0.555338,7.385751
1,1,19.459274,1.019596,0.391095,0.202314,0.035023,0.012180,0.290197,4.440008,9.828326,...,4.370077,2.266101,0.117615,0.078961,3.053336,7.006424,9.814404,0.048076,0.555338,7.385751
2,2,19.459274,1.019596,0.391095,0.202314,0.035023,0.012180,0.290197,4.440008,9.828326,...,4.370077,2.266101,0.117615,0.078961,3.053336,7.006424,9.814404,0.048076,0.555338,7.385751
3,3,19.459274,1.019596,0.391095,0.202314,0.035023,0.012180,0.290197,4.440008,9.828326,...,4.370077,2.266101,0.117615,0.078961,3.053336,7.006424,9.814404,0.048076,0.555338,7.385751
4,4,19.459274,1.019596,0.391095,0.202314,0.035023,0.012180,0.290197,4.440008,9.828326,...,4.370077,2.266101,0.117615,0.078961,3.053336,7.006424,9.814404,0.048076,0.555338,7.385751
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8746,8746,0.743481,1.860882,0.348647,0.396076,0.039056,0.014734,2.619609,5.732972,0.504431,...,7.599976,6.262046,0.073156,0.108892,0.941119,9.515523,1.983941,0.043303,0.028719,0.226074
8747,8747,0.743481,1.860882,0.348647,0.396076,0.039056,0.014734,2.619609,5.732972,0.504431,...,7.599976,6.262046,0.073156,0.108892,0.941119,9.515523,1.983941,0.043303,0.028719,0.226074
8748,8748,0.743481,1.860882,0.348647,0.396076,0.039056,0.014734,2.619609,5.732972,0.504431,...,7.599976,6.262046,0.073156,0.108892,0.941119,9.515523,1.983941,0.043303,0.028719,0.226074
8749,8749,0.743481,1.860882,0.348647,0.396076,0.039056,0.014734,2.619609,5.732972,0.504431,...,7.599976,6.262046,0.073156,0.108892,0.941119,9.515523,1.983941,0.043303,0.028719,0.226074
8750,8750,0.722735,1.622826,0.330114,0.405208,0.035643,0.014002,2.826391,4.465347,0.011147,...,9.327925,8.882620,0.076847,0.109450,0.774720,9.562726,1.410069,0.043550,0.025087,0.173824

In [108]:
# E se o arquivo tem mais de uma aba?
arquivo_6 = pd.read_excel(io="./Dados/arquivo6.xlsx", sheet_name=None)
arquivo_6["A"]

    Time [h]  Cell [g/L]  Glucose [g/L]  Xylose [g/L]  Ethanol [g/L]
0          0   12.020070      12.528429     47.368901       0.605559
1          1   12.171590      12.235646     47.040265       1.174964
2          2   12.326785      11.396671     46.572356       1.905466
3          3   12.484214       9.370715     45.910947       2.826546
4          4   12.642350       5.998412     44.985505       3.962882
5          5   12.799639       2.791232     43.708940       5.327675
6          6   12.954561       1.011180     41.982199       6.915026
7          7   13.105683       0.303476     39.707409       8.693681
8          8   13.251718       0.060384     36.812688      10.605348
9          9   13.391559       0.000000     33.287267      12.570114
10        10   13.524304       0.000000     29.216183      14.498795
11        11   13.649277       0.000000     24.794017      16.308547
12        12   13.766018       0.000000     20.298615      17.936230
13        13   13.874277       0.000000     16.026435      19.345289
14        14   13.973996       0.000000     12.218541      20.525309
15        15   14.065278       0.000000      9.013631      21.486389
16        16   14.148362       0.000000      6.443874      22.251555
17        17   14.223593       0.000000      4.462320      22.849794
18        18   14.291393       0.000000      2.979864      23.310922
19        19   14.352239       0.000000      1.895708      23.662485
20        20   14.406636       0.000000      1.115941      23.928280
21        21   14.455102       0.000000      0.561801      24.127962
22        22   14.498155       0.000000      0.171355      24.277262
23        23   14.536295       0.000000      0.000000      24.388495
24        24   14.570002       0.000000      0.000000      24.471147
25        25   14.599730       0.000000      0.000000      24.532440

### read_html
A função [`read_html`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_html.html) permite realizar a leitura de uma tabela contida num site. Para utilizar está função aplicamos a seguinte sintaxe:
```python
pandas.read_html(io, match='.+', flavor=None, header=None, index_col=None, skiprows=None, attrs=None, parse_dates=False, tupleize_cols=None, thousands=', ', encoding=None, decimal='.', converters=None, na_values=None, keep_default_na=True, displayed_only=True)
```

In [114]:
tabela_html_1 = pd.read_html("http://www.ipeadata.gov.br/ExibeSerie.aspx?serid=32098&module=M")
tabela_html_1[2]

           0                                                  1
0       Data  Taxa de cÃ¢mbio - R$ / US$ - comercial - compr...
1    1953.01                                         6,6836E-15
2    1953.02                                         1,3378E-14
3    1953.03                                         1,3378E-14
4    1953.04                                         1,4884E-14
..       ...                                                ...
808  2020.04                                              53250
809  2020.05                                              56429
810  2020.06                                              51960
811  2020.07                                              52796
812  2020.08                                              54606

[813 rows x 2 columns]

In [118]:
tabela_html_2 = pd.read_html("https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/banklist.html")
tabela_html_2[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
...,...,...,...,...,...,...
556,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
557,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
558,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
559,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
560,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

### to_csv
A função [`to_csv`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_csv.html) permite exportar um DataFrame para um arquivo .csv. A sintaxe para utilizar esta função e:
```python
DataFrame.to_csv(path_or_buf=None, sep=',', na_rep='', float_format=None, columns=None, header=True, index=True, index_label=None, mode='w', encoding=None, compression='infer', quoting=None, quotechar='"', line_terminator=None, chunksize=None, date_format=None, doublequote=True, escapechar=None, decimal='.', errors='strict')
```

In [122]:
tabela_html_1[2].to_csv("html_to_csv.csv", sep='-')

### to_excel
A função [`to_excel`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_excel.html) permite exportar uma DataFrame para um arquivo .xlsx. A sintaxe para utilizar esta função e:
```python
DataFrame.to_excel(excel_writer, sheet_name='Sheet1', na_rep='', float_format=None, columns=None, header=True, index=True, index_label=None, startrow=0, startcol=0, engine=None, merge_cells=True, encoding=None, inf_rep='inf', verbose=True, freeze_panes=None)
```

In [120]:
tabela_html_2[0].to_excel("html_to_excel.xlsx")

In [ ]:
series  = ["A", "B"]
for s in series:
    pd.read_html(s)